from diagonal_matrix import DiagonalMatrix


matrix = DiagonalMatrix()
matrix.init_from_list([
    [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0],
    [1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0],
    [1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    [0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0],
    [0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0],
    [1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
    [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1],
    [0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
    [0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
])

print('-- Исходная матрица --')
print(matrix)

print('\n-- Пример чтения слова --')
print(f'   слово 0: {matrix.get_word(0)}')
print(f'   слово 7: {matrix.get_word(7)}')


print('\n-- Пример чтения столбца --')
print(f'   столбец 2: {matrix.get_word(2)}')
print(f'   столбец 9: {matrix.get_word(9)}')

print('\n-- Пример логический функций --')

print(f'   функция f0  для слов 0 и 1   -- {matrix.f0(0, 0)}')
print(f'   функция f5  для слов 5 и 6   -- {matrix.f5(5, 6)}')
print(f'   функция f10 для слов 10 и 11 -- {matrix.f10(10, 11)}')
print(f'   функция f15 для слов 14 и 15 -- {matrix.f15(14, 15)}')

print('\n-- Пример арифметической операции при V = [1, 0, 1] --')
print(f'   матрица, после операции')
matrix.sum_V([1, 0, 1])
print(matrix)

print('\n-- Пример поиска ближайшего слова --')
matrix.write_word(5, matrix.get_word(2))
matrix.write_word(14, matrix.get_word(2))
print("Ближайший сверху:", matrix.search_by_correspondence(2, "top"))   # 5
print("Ближайший снизу:", matrix.search_by_correspondence(2, "bottom")) # 14
